//Задача 3: имаме две променливи int x = 10; и int y = 10;
//създайте две променливи int true, false; На true присвоете
//резултата от инкрементирането на ++х плюс оператор логическо
//ИЛИ поставен между х и у . Принтирайте резултата

#include <stdio.h>
    int main (){
    int x = 10;
    int y = 10;
    int true, false;
        
    true = ++x + x||y;
    
    //Първо се инкрементира, после се гледа логическата част
    //стойността на поне едната от двете променливи е повече от 0
    // значи true присвоява стойност 1.
    
    printf("%d\n", true);
    return 0;
}
