//Задача 5:
//В какъв ред ще се изпълни операторът запетая , ?
#include <stdio.h>
int main() {
    int x = 1, y = 0;
    int z = y || x; // 1 и 0 при оператор OR е равно на 1
    printf("\nInit values: X= %d, Y= %d\n", x, y);
    x = 1 + 2, 2 * 3, 3 + 4; // гледа се само 1+2, след това програмата спира
    y = ( 7 * 8, 8 + 9, 9 - 4); // гледа се последната двойка само
    printf("\nX= %d, Y= %d\n", x, y);
    return 0;
}